html/org-pages/qc1/week19.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-23 Mon 18:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Week 19 - my notes</title>
<meta name="author" content="Luís Spengler" />
<meta name="description" content="Week 19 - my notes" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://luispengler.github.io/site/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://luispengler.github.io/site/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Week 19 - my notes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org50b7a27">Week 19 - Grover&rsquo;s Algorithm</a>
<ul>
<li><a href="#orgd93826a">Review</a></li>
<li><a href="#orgfc04e5e">Grover&rsquo;s Algorithm 101</a></li>
<li><a href="#orgafc21f3">Grover&rsquo;s &amp; the Quantum Resources</a></li>
<li><a href="#orgcb7b185">The Circuit Behind Grover&rsquo;s</a></li>
<li><a href="#orgea46eff">Grover nowadays</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org50b7a27" class="outline-2">
<h2 id="org50b7a27">Week 19 - Grover&rsquo;s Algorithm</h2>
<div class="outline-text-2" id="text-org50b7a27">
</div>
<div id="outline-container-orgd93826a" class="outline-3">
<h3 id="orgd93826a">Review</h3>
<div class="outline-text-3" id="text-orgd93826a">
<ul class="org-ul">
<li>Classical algortihms can be slow and inneficient. Some even struggle to solve certain complex problems</li>
<li>Linear Search goes through each element until it finds the right item - we go through this even with which a huge dataset (super inneficient, right?)</li>
<li>Linear Search is not scalable</li>
</ul>
</div>
</div>

<div id="outline-container-orgfc04e5e" class="outline-3">
<h3 id="orgfc04e5e">Grover&rsquo;s Algorithm 101</h3>
<div class="outline-text-3" id="text-orgfc04e5e">
<ul class="org-ul">
<li>It is a quantum algortihm that leverages amplitude amplification to speed up search</li>
<li>As weel as demonstrating quadradic speedup</li>
<li>We apply Grover&rsquo;s Algorithm to unstructured search, but you know what you are looking for, you just don&rsquo;t know where it is!</li>
<li>Summarizing: It is a quantum algortihm that leverages superposition and interference to speed up the process</li>
</ul>
<p>
\[number of operations used in Grover's algorithm \approx \sqrt{number of operations used in linear search}\]
</p>
<ul class="org-ul">
<li>Meaning:</li>
</ul>
<p>
\[O(\sqrt{n})\]
</p>
</div>
</div>

<div id="outline-container-orgafc21f3" class="outline-3">
<h3 id="orgafc21f3">Grover&rsquo;s &amp; the Quantum Resources</h3>
<div class="outline-text-3" id="text-orgafc21f3">
<ul class="org-ul">
<li>Superposition: Combination of the 0 and 1 states</li>
<li>Interference: Interaction between waves &#x2013; they can add on to each other or cancel out</li>
<li>We can create a superposition with all the possible different choices &#x2013; all choices are equally likely</li>
<li>As the algorithm goes on, the probability of incorrect choices reduces (interference) &#x2013; amplitude amplification</li>
<li>At the final state, you make a measurement, and with a very high probability, we find where it is</li>
</ul>
</div>
</div>

<div id="outline-container-orgcb7b185" class="outline-3">
<h3 id="orgcb7b185">The Circuit Behind Grover&rsquo;s</h3>
<div class="outline-text-3" id="text-orgcb7b185">
<ul class="org-ul">
<li>Last week we learned that designing a quantum algorithm means translating words into linear algebra</li>
<li>In the starting point, we just apply an H gate to each qubit</li>
</ul>
<p>
\[\frac{1}{2}\begin{bmatrix}1\\1\\1\\1\end{bmatrix\]
</p>
<ul class="org-ul">
<li>At the end, we wanna know the right answer.</li>
</ul>
<p>
\[\begin{bmatrix}0\\0\\0\\1\end{bmatrix}\]
</p>
<ul class="org-ul">
<li>Which gate do we use from going from the starting point to the end point?</li>
</ul>
</div>

<div id="outline-container-orge266bae" class="outline-4">
<h4 id="orge266bae">The circuit step by step</h4>
<div class="outline-text-4" id="text-orge266bae">
<ul class="org-ul">
<li>Step 1: H gates</li>
<li>Step 2: Oracle and Grover&rsquo;s Operator
<ul class="org-ul">
<li>Part 1: Oracle - It flips the sign of the corresponding to the item we want to find (Z gate or CZ gate) - You know how Waldo looks like, so you can affect him (like e needle you need to find, using a magnet you can affect it even not knowing where it is)</li>
<li>Part 2: Grover&rsquo;s Operator - flips all the states around the average</li>
</ul></li>
<li>We repeat step 2 approx sqrt N times</li>
<li>Step 3: Measurement - Measure the state, with high probability the result will be the option we are looking for</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgea46eff" class="outline-3">
<h3 id="orgea46eff">Grover nowadays</h3>
<div class="outline-text-3" id="text-orgea46eff">
<ul class="org-ul">
<li>It is a long-term algorithm: we will need a lot of fault-tolerant qubits; about 10,000 qubits to see an advantage over linear search</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Luís Spengler</p>
<p class="date">Created: 2022-05-23 Mon 18:15</p>
</div>
</body>
</html>
